package constants

const (
	// -- MESSAGES --
	ErrorMsgText = "Извини, попробуй еще раз чуть позже, какая-то проблема"
	UnexpectedCommandMsgText = "Такой команды нет!"
	UnexpectedUserMsgText = "Похоже, что-то сломалось. Попробуй заново пройти авторизацию, отправив команду /start."
	NotAuthenticated = "Ты не авторизован! Запусти команду - /start"
	HelloMsgText = "Привет, %s из города %s! Перейди по этой %s, чтобы пройти аунтификацию в системе.\nПосле того как ты перешел и успешно авторизовался введи команду /groups, для получения пригласительных ссылок в чаты :)"
	GreetNotRemoteText = "Для получения всех нужныйх ссылок введи команду - /groups. А, также можешь вступить в чат твоего офиса - %s!"
	HelpMsgText = "Привет, для запуска бота введи команду /start или если он уже запущен, то ты можешь получить нужные ссылки введя команду /groups. Но если тебя не внесли в базу ты не сможешь получить ссылки :("
	// -- LINKS --
	ZbrLinks = `
	Общаемся с ребятами мы в основном здесь — в телеге. Тебе нужно добавиться в основные чаты компании, в остальные уже на твоё усмотрение 🙃
	1️⃣Info — общий информационный чат компании. Тут публикуются новости. Его нужно смотреть 🤓
	Ссылка приглашение — 
	2️⃣team —  чат быть в курсе всей корпоративной повестки компании. 
	Ссылка приглашение — 
	3️⃣ Это общий чат для общения (при желании, можно мьютить). 
	Ссылка приглашение — 
	4️⃣ входит в группу компаний.
	group (холдинг) — информационный чат по всей группе компаний. Его тоже нужно смотреть 😎
	Ссылка приглашение — 
	
	Список чатов по локациям и интересам — 
	Выбирай и добавляйся!
	`

	AuthLinkTemplate = ""
)